{
  "Wavecraft": {
    "Concept": {
      "Story": {

      },
      "Gameplay": {
        "Basis": "The player attacked enemies with Right Click, collects data with Left Click. Data is abundant and must be collected completely before progressing to the next area. The player must mostly avoid enemies, since ammo will be scarce and for tactical use only. Mazes kill upon contact with the walls, enemies throughout.",
        "Collectors":  {
          "Lazer Collector": "Straight line that collects all data in its path",
          "Bomb Collector": "Grenade that bounces off surfaces and eventually explodes on contact with a data module or after a certain amount of time",
          "AOE Collector": "Radiates a collection sphere around the player that collects data on contact"
        },
        "Weapons": {
          "Spike Pellet": "A bullet that hits the target. Common",
          "Arc Lazer": "A lazer that remains active while Right Click is pressed. Cursor must be on enemy",
          "Whip": "Hits in an arc, a wedge of damage with a close radius"
        }
      }
    },
    "Enemies": {
      "Spore": {
        "Description": "",
        "HP": 0,
        "AP": 0
      },
      "Squid": {
        "Description": "",
        "HP": 0,
        "AP": 0
      }
    },
    "Player": {
      "Biography" : "",
      "HP": 0,
      "AP": 0,
      "Abilities": {
        "DataCollector": {
          "Description": "",
          "Damage": 0
        }
      }
    },
    "UI": {

    },
    "NPC": {

    }
  },

  "Scripts": {
    "Ideas": {

      "MeshTrigger": "Create a Mesh that defines the bounds of a meshcollider",

      "Camera-Revamp": {
        "Concept": "Redo the camera system. Create a debug mode that can be toggled on and off. With Debug enabled you can move the camera in x/y with the arrowkeys or WASD. Save the position of the camera before debug was toggled on so that the camera returns to that position when Debug is toggled back off. Create variables for points in the z axis that correspond to the player/enemy coord and coords needed to compensate for FOV. Create a mechanism for creating transform points for cinematic viewpoints, and set up scene gizmos for that. Create a mechanism for creating teleportation points which both the camera and player can be moved to a specific location for easy iteration"
      },

      "Camera shift": "Redo in tandem with Camera-Revamp. Create triggers that shift the camera to a specific transform at a specific angle. Set the axis in which the camera will follow the player. Return the camera to a specific location and rotation when triggered from the other side."
      
    }
  }
}